{
    "pages":{
        "index": "Ignacio Tomás",
        "about": "Sobre mí | Ignacio Tomás",
        "contact": "Contacto | Ignacio Tomás"
    },
    "menu": {
        "download": "Descargar CV",
        "download-short": "CV",
        "github": "GitHub",
        "linkedin": "linkedin",
        "phone": "Teléfono",
        "mail": "Correo Electrónico",
        "language": {
            "es": "Español",
            "en": "Inglés"
        }
    },
    "main":{
        "presentation":{
            "title": "Desarrollador Frontend",
            "description": "Soy un desarrollador de Frontend. Mi especialidad es React, aunque sigo formándome en diversos frameworks web como Next.js y Node.js. Tengo experiencia desarollando proyectos en HTML con Css y Sass.",
            "contact_btn": "Contacta Conmigo"
        }
    },
    "about":{
        "title": "Sobre Mí",
        "paragraph1": "Hola, soy Ignacio Tomás Floría, soy desarrollador Frontend y me encanta crear y desarrollar proyectos nuevos y desafiantes que me permitan seguir aprendiendo y creciendo como profesional. Empecé a programar hace unos pocos años, cuando salí del Bachillerato y decí cursar un grado superior en Redes Informáticas. Ahí, aunque fuese poco, aprendí las nociones basicas de la programación web con HTML y CSS. Desde entonces gracias a un compañero y buen amigo, que me enseñó casi todo lo que sé acerca de la programación web, me he ido especializando en diversos lenguajes de programación web. He podido participar en diversos preyctos en mi primer trabajo como desarrollador web, que van desde una aplicación movil para hacer reservas de pistas de padel hasta una Intranet.",
        "paragraph2": "En estos pocos años como desarrollador web, he podido aprender y trabajar con distintos lenguajes de programación web."
    },
    "contact":{
        "title":"Contacta Conmigo",
        "form":{
            "name": {
                "title": "Nombre y Apellido",
                "placehld": "Ej. John Doe"
            },
            "company": {
                "title": "Empresa",
                "placehld": "Ej. Mi Empresa"
            },
            "mail": {
                "title": "Correo Electrónico",
                "placehld": "Ej. ejemplo@gmail.com"
            },
            "subject": "Asunto",
            "message": "Mensaje Adicional",
            "submit": "Enviar Consulta",
            "required": "Campo Requerido",
            "success": "Mensaje enviado con éxito",
            "error": {
                "server": "Algo ha ido mal, inténtalo más tarde",
                "empty": "Por favor, rellena todos los campos"
            }
        },
        "description": "Mándame un mensaje con cualquier duda que tengas acerca de mi perifl o de mi experiencia. También puedes usuar el formulario para cualquier oferta o propuesta que quieras hacerme. Reviso mi email diariamente y suelo contestar de forma inmediata, por lo que no tardarás en recibir una respuesta por mi parte.",
        "icons":{
            "linkedin": "Contacta conmigo vía Linkedin",
            "phone": "Llámame si tienes alguna duda",
            "addres": "Mi Dirección"
        }
    },
    "mail":{
        "subject": "Mensaje recibido"
    },
    "footer": {
        "contact-title": "Contacta conmigo"
    },
    "env":{
        "mode": {
            "dev": "Modo Desarrollo",
            "prod": "Modo Producción"
        }
    }
}